HUNDREDS = {
    0: "",
    1: "сто",
    2: "двести",
    3: "триста",
    4: "четыреста",
    5: "пятьсот",
    6: "шестьсот",
    7: "семьсот",
    8: "восемьсот",
    9: "девятьсот"
}

TENS = {
    0: "",
    1: "десять",
    2: "двадцать",
    3: "тридцать",
    4: "сорок",
    5: "пятьдесят",
    6: "шестьдесят",
    7: "семьдесят",
    8: "восемьдесят",
    9: "девяносто"
}

TEENS = {
    10: "десять",
    11: "одиннадцать",
    12: "двенадцать",
    13: "тринадцать",
    14: "четырнадцать",
    15: "пятнадцать",
    16: "шестнадцать",
    17: "семнадцать",
    18: "восемнадцать",
    19: "девятнадцать"
}

UNITS = {
    0: "ноль",
    1: "один",
    2: "два",
    3: "три",
    4: "четыре",
    5: "пять",
    6: "шесть",
    7: "семь",
    8: "восемь",
    9: "девять"
}


def name_number(number: int) -> str:
    """
    Возвращает строку, называющую введённое число русскими словами.
    В случае выхода за пределы допустимых значений возвращает об этом сообщение.
    :param number: целое число от 0 (включительно) до 1000 (исключительно)
    :return: строку, выражающую данное число на русском языке. Сообщение об
            исключении в случае выхода за область допустимого определения.
    """
    if 0 <= number < 1000:
        hundreds, tens, units = number // 100, (number // 10) % 10, number % 10
        output = []
        match len(str(number)):
            case 1:
                output.append(UNITS[number])

            case 2:
                if tens == 1:
                    output.append(TEENS[number])
                else:
                    output.append(TENS[tens])
                    if units != 0:
                        output.append(name_number(units))

            case 3:
                output.append(HUNDREDS[hundreds])
                if units != 0 or tens != 0:
                    output.append(name_number(number % 100))

        return ' '.join(output)

    return "<за пределами реализации>"


print('Это программа умеет по-русски называть числа до тысячи.')
while (number := input('Введите число: ')) != "":
    print(name_number(int(number)))
print('Спасибо за интерес к арифметике и русскому языку!')
